MicrochipTech/wcm-aws-iot-sdk/microchip/harmony/v1_06/framework/peripheral/dma/processor/dma_p32mx695f512h.h
typedef enum {

    DMA_CRC_IP_HEADER = 0x1,
    DMA_CRC_LFSR = 0x0

} DMA_CRC_TYPE;

typedef enum {

    DMA_CRC_BYTEORDER_NO_SWAPPING = 0x0,
    DMA_CRC_SWAP_BYTE_ON_WORD_BOUNDARY = 0x1,
    DMA_CRC_SWAP_HALF_WORD_ON_WORD_BOUNDARY = 0x2,
    DMA_CRC_SWAP_BYTE_ON_HALF_WORD_BOUNDARY = 0x3

} DMA_CRC_BYTE_ORDER;

typedef enum {

    DMA_INT_ADDRESS_ERROR = 0x1,
    DMA_INT_TRANSFER_ABORT = 0x2,
    DMA_INT_CELL_TRANSFER_COMPLETE = 0x4,
    DMA_INT_BLOCK_TRANSFER_COMPLETE = 0x8,
    DMA_INT_DESTINATION_HALF_FULL = 0x10,
    DMA_INT_DESTINATION_DONE = 0x20,
    DMA_INT_SOURCE_HALF_EMPTY = 0x40,
    DMA_INT_SOURCE_DONE = 0x80

} DMA_INT_TYPE;

typedef enum {

    DMA_CRC_BIT_ORDER_LSB = 0x1,
    DMA_CRC_BIT_ORDER_MSB = 0x0

} DMA_CRC_BIT_ORDER;

typedef enum {

    DMA_PATTERN_LENGTH_NONE

} DMA_PATTERN_LENGTH;

typedef enum {

    DMA_CHANNEL_COLLISION_NOT_SUPPORTED = 0x0

} DMA_CHANNEL_COLLISION;

typedef enum {

    DMA_PING_PONG_MODE_NOT_SUPPORTED = 0x0

} DMA_PING_PONG_MODE;

typedef enum {

    DMA_CHANNEL_TRANSFER_DIRECTION_NOT_SUPPORTED = 0

} DMA_CHANNEL_TRANSFER_DIRECTION;

typedef enum {

    DMA_ADDRESS_OFFSET_TYPE_NOT_SUPPORTED = 0

} DMA_ADDRESS_OFFSET_TYPE;

typedef enum {

    DMA_SOURCE_ADDRESSING_MODE_NOT_SUPPORTED = 0

} DMA_SOURCE_ADDRESSING_MODE;

typedef enum {

    DMA_DESTINATION_ADDRESSING_MODE_NOT_SUPPORTED = 0

} DMA_DESTINATION_ADDRESSING_MODE;

typedef enum {

    DMA_CHANNEL_ADDRESSING_MODE_NOT_SUPPORTED = 0

} DMA_CHANNEL_ADDRESSING_MODE;

typedef enum {

    DMA_CHANNEL_DATA_SIZE_NOT_SUPPORTED = 0

} DMA_CHANNEL_DATA_SIZE;

typedef enum {

    DMA_TRANSFER_MODE_NOT_SUPPORTED = 0

} DMA_TRANSFER_MODE;

PLIB_INLINE SFR_TYPE* _DMA_BUSY_VREG(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return &DMACON;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _DMA_SUSPEND_VREG(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return &DMACON;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _DMA_ENABLE_CONTROL_VREG(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return &DMACON;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _DMA_CHANNELBITS_VREG(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return &DMASTAT;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _DMA_LASTBUSACCESS_VREG(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return &DMASTAT;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _DMA_RECENTADDRESS_VREG(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return &DMAADDR;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _DMA_CRC_CHANNEL_VREG(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return &DCRCCON;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _DMA_CRC_TYPE_VREG(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return &DCRCCON;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _DMA_CRC_APPEND_MODE_VREG(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return &DCRCCON;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _DMA_CRC_ENABLE_VREG(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return &DCRCCON;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _DMA_CRC_POLYNOMIAL_LENGTH_VREG(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return &DCRCCON;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _DMA_CRC_BIT_ORDER_VREG(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return &DCRCCON;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _DMA_CRC_WRITE_BYTE_ORDER_VREG(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return &DCRCCON;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _DMA_CRC_BYTE_ORDER_VREG(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return &DCRCCON;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _DMA_CRC_DATA_VREG(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return &DCRCDATA;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _DMA_CRC_XOR_ENABLE_VREG(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return &DCRCXOR;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _DMA_CHANNEL_X_PRIORITY_VREG(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return &DCH0CON;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _DMA_CHANNEL_X_EVENT_VREG(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return &DCH0CON;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

