MicrochipTech/wcm-aws-iot-sdk/microchip/harmony/v1_06/framework/peripheral/dma/processor/dma_p32mx695f512h.h
PLIB_INLINE SFR_TYPE* _DMA_CHANNEL_X_AUTO_VREG(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return &DCH0CON;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _DMA_CHANNEL_X_CHAIN_ENABLE_VREG(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return &DCH0CON;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _DMA_CHANNEL_X_DISABLED_VREG(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return &DCH0CON;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _DMA_CHANNEL_X_VREG(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return &DCH0CON;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _DMA_CHANNEL_X_CHAIN_VREG(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return &DCH0CON;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _DMA_CHANNEL_X_BUSY_VREG(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return &DCH0CON;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _DMA_CHANNEL_X_TRIGGER_AIRQEN_VREG(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return &DCH0ECON;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _DMA_CHANNEL_X_TRIGGER_SIRQEN_VREG(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return &DCH0ECON;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _DMA_CHANNEL_X_TRIGGER_PATEN_VREG(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return &DCH0ECON;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _DMA_ABORT_TRANSFER_VREG(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return &DCH0ECON;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _DMA_START_TRANSFER_VREG(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return &DCH0ECON;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _DMA_CHANNEL_X_STARTIRQ_VREG(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return &DCH0ECON;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _DMA_CHANNEL_X_ABORTIRQ_VREG(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return &DCH0ECON;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _DMA_CHANNEL_X_INTSOURCEFLAG_CHERIF_VREG(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return &DCH0INT;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _DMA_CHANNEL_X_INTSOURCEFLAG_CHTAIF_VREG(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return &DCH0INT;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _DMA_CHANNEL_X_INTSOURCEFLAG_CHCCIF_VREG(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return &DCH0INT;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _DMA_CHANNEL_X_INTSOURCEFLAG_CHBCIF_VREG(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return &DCH0INT;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _DMA_CHANNEL_X_INTSOURCEFLAG_CHDHIF_VREG(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return &DCH0INT;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _DMA_CHANNEL_X_INTSOURCEFLAG_CHDDIF_VREG(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return &DCH0INT;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _DMA_CHANNEL_X_INTSOURCEFLAG_CHSHIF_VREG(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return &DCH0INT;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _DMA_CHANNEL_X_INTSOURCEFLAG_CHSDIF_VREG(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return &DCH0INT;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _DMA_CHANNEL_X_INTSOURCE_CHERIE_VREG(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return &DCH0INT;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _DMA_CHANNEL_X_INTSOURCE_CHTAIE_VREG(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return &DCH0INT;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _DMA_CHANNEL_X_INTSOURCE_CHCCIE_VREG(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return &DCH0INT;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _DMA_CHANNEL_X_INTSOURCE_CHBCIE_VREG(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return &DCH0INT;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

