MicrochipTech/wcm-aws-iot-sdk/microchip/harmony/v1_06/framework/peripheral/dma/processor/dma_p32mx695f512h.h
PLIB_INLINE SFR_TYPE* _DMA_CHANNEL_X_INTSOURCE_CHDHIE_VREG(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return &DCH0INT;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _DMA_CHANNEL_X_INTSOURCE_CHDDIE_VREG(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return &DCH0INT;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _DMA_CHANNEL_X_INTSOURCE_CHSHIE_VREG(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return &DCH0INT;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _DMA_CHANNEL_X_INTSOURCE_CHSDIE_VREG(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return &DCH0INT;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _DMA_CHANNEL_X_SOURCESTARTADDRESS_VREG(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return &DCH0SSA;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _DMA_CHANNEL_X_DESTINATIONSTARTADDRESS_VREG(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return &DCH0DSA;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _DMA_CHANNEL_X_SOURCESIZE_VREG(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return &DCH0SSIZ;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _DMA_CHANNEL_X_DESTINATIONSIZE_VREG(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return &DCH0DSIZ;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _DMA_CHANNEL_X_SOURCEPOINTER_VREG(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return &DCH0SPTR;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _DMA_CHANNEL_X_DESTINATIONPOINTER_VREG(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return &DCH0DPTR;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _DMA_CHANNEL_X_CELLSIZE_VREG(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return &DCH0CSIZ;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _DMA_CHANNEL_X_CELLPROGRESSPOINTER_VREG(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return &DCH0CPTR;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _DMA_CHANNEL_X_PATTERNDATA_VREG(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return &DCH0DAT;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_BUSY_MASK(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DMACON_DMABUSY_MASK;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_SUSPEND_MASK(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DMACON_SUSPEND_MASK;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_ENABLE_CONTROL_MASK(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DMACON_ON_MASK;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNELBITS_MASK(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DMASTAT_DMACH_MASK;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_LASTBUSACCESS_MASK(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DMASTAT_RDWR_MASK;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_RECENTADDRESS_MASK(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return (SFR_DATA)-1;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CRC_CHANNEL_MASK(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCRCCON_CRCCH_MASK;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CRC_TYPE_MASK(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCRCCON_CRCTYP_MASK;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CRC_APPEND_MODE_MASK(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCRCCON_CRCAPP_MASK;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CRC_ENABLE_MASK(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCRCCON_CRCEN_MASK;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CRC_POLYNOMIAL_LENGTH_MASK(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCRCCON_PLEN_MASK;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CRC_BIT_ORDER_MASK(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCRCCON_BITO_MASK;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CRC_WRITE_BYTE_ORDER_MASK(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCRCCON_WBO_MASK;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

