MicrochipTech/wcm-aws-iot-sdk/microchip/harmony/v1_06/framework/peripheral/dma/processor/dma_p32mx695f512h.h
PLIB_INLINE SFR_DATA _DMA_CRC_BYTE_ORDER_MASK(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCRCCON_BYTO_MASK;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CRC_DATA_MASK(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return (SFR_DATA)-1;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CRC_XOR_ENABLE_MASK(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return (SFR_DATA)-1;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_PRIORITY_MASK(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCH0CON_CHPRI_MASK;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_EVENT_MASK(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCH0CON_CHEDET_MASK;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_AUTO_MASK(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCH0CON_CHAEN_MASK;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_CHAIN_ENABLE_MASK(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCH0CON_CHCHN_MASK;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_DISABLED_MASK(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCH0CON_CHAED_MASK;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_MASK(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCH0CON_CHEN_MASK;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_CHAIN_MASK(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCH0CON_CHCHNS_MASK;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_BUSY_MASK(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCH0CON_CHBUSY_MASK;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_TRIGGER_AIRQEN_MASK(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCH0ECON_AIRQEN_MASK;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_TRIGGER_SIRQEN_MASK(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCH0ECON_SIRQEN_MASK;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_TRIGGER_PATEN_MASK(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCH0ECON_PATEN_MASK;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_ABORT_TRANSFER_MASK(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCH0ECON_CABORT_MASK;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_START_TRANSFER_MASK(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCH0ECON_CFORCE_MASK;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_STARTIRQ_MASK(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCH0ECON_CHSIRQ_MASK;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_ABORTIRQ_MASK(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCH0ECON_CHAIRQ_MASK;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_INTSOURCEFLAG_CHERIF_MASK(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCH0INT_CHERIF_MASK;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_INTSOURCEFLAG_CHTAIF_MASK(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCH0INT_CHTAIF_MASK;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_INTSOURCEFLAG_CHCCIF_MASK(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCH0INT_CHCCIF_MASK;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_INTSOURCEFLAG_CHBCIF_MASK(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCH0INT_CHBCIF_MASK;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_INTSOURCEFLAG_CHDHIF_MASK(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCH0INT_CHDHIF_MASK;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_INTSOURCEFLAG_CHDDIF_MASK(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCH0INT_CHDDIF_MASK;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

