MicrochipTech/wcm-aws-iot-sdk/microchip/harmony/v1_06/framework/peripheral/dma/processor/dma_p32mx695f512h.h
PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_INTSOURCEFLAG_CHSHIF_MASK(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCH0INT_CHSHIF_MASK;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_INTSOURCEFLAG_CHSDIF_MASK(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCH0INT_CHSDIF_MASK;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_INTSOURCE_CHERIE_MASK(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCH0INT_CHERIE_MASK;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_INTSOURCE_CHTAIE_MASK(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCH0INT_CHTAIE_MASK;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_INTSOURCE_CHCCIE_MASK(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCH0INT_CHCCIE_MASK;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_INTSOURCE_CHBCIE_MASK(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCH0INT_CHBCIE_MASK;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_INTSOURCE_CHDHIE_MASK(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCH0INT_CHDHIE_MASK;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_INTSOURCE_CHDDIE_MASK(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCH0INT_CHDDIE_MASK;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_INTSOURCE_CHSHIE_MASK(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCH0INT_CHSHIE_MASK;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_INTSOURCE_CHSDIE_MASK(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCH0INT_CHSDIE_MASK;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_SOURCESTARTADDRESS_MASK(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return (SFR_DATA)-1;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_DESTINATIONSTARTADDRESS_MASK(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return (SFR_DATA)-1;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_SOURCESIZE_MASK(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return (SFR_DATA)-1;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_DESTINATIONSIZE_MASK(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return (SFR_DATA)-1;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_SOURCEPOINTER_MASK(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return (SFR_DATA)-1;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_DESTINATIONPOINTER_MASK(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return (SFR_DATA)-1;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_CELLSIZE_MASK(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return (SFR_DATA)-1;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_CELLPROGRESSPOINTER_MASK(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return (SFR_DATA)-1;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_PATTERNDATA_MASK(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return (SFR_DATA)-1;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_BUSY_POS(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DMACON_DMABUSY_POSITION;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_SUSPEND_POS(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DMACON_SUSPEND_POSITION;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_ENABLE_CONTROL_POS(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DMACON_ON_POSITION;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNELBITS_POS(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DMASTAT_DMACH_POSITION;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_LASTBUSACCESS_POS(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DMASTAT_RDWR_POSITION;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_RECENTADDRESS_POS(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return (SFR_DATA)0;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CRC_CHANNEL_POS(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCRCCON_CRCCH_POSITION;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CRC_TYPE_POS(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCRCCON_CRCTYP_POSITION;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CRC_APPEND_MODE_POS(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCRCCON_CRCAPP_POSITION;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

