MicrochipTech/wcm-aws-iot-sdk/microchip/harmony/v1_06/framework/peripheral/dma/processor/dma_p32mx695f512h.h
PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_INTSOURCEFLAG_CHCCIF_POS(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCH0INT_CHCCIF_POSITION;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_INTSOURCEFLAG_CHBCIF_POS(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCH0INT_CHBCIF_POSITION;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_INTSOURCEFLAG_CHDHIF_POS(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCH0INT_CHDHIF_POSITION;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_INTSOURCEFLAG_CHDDIF_POS(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCH0INT_CHDDIF_POSITION;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_INTSOURCEFLAG_CHSHIF_POS(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCH0INT_CHSHIF_POSITION;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_INTSOURCEFLAG_CHSDIF_POS(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCH0INT_CHSDIF_POSITION;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_INTSOURCE_CHERIE_POS(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCH0INT_CHERIE_POSITION;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_INTSOURCE_CHTAIE_POS(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCH0INT_CHTAIE_POSITION;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_INTSOURCE_CHCCIE_POS(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCH0INT_CHCCIE_POSITION;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_INTSOURCE_CHBCIE_POS(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCH0INT_CHBCIE_POSITION;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_INTSOURCE_CHDHIE_POS(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCH0INT_CHDHIE_POSITION;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_INTSOURCE_CHDDIE_POS(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCH0INT_CHDDIE_POSITION;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_INTSOURCE_CHSHIE_POS(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCH0INT_CHSHIE_POSITION;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_INTSOURCE_CHSDIE_POS(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCH0INT_CHSDIE_POSITION;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_SOURCESTARTADDRESS_POS(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return (SFR_DATA)0;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_DESTINATIONSTARTADDRESS_POS(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return (SFR_DATA)0;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_SOURCESIZE_POS(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return (SFR_DATA)0;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_DESTINATIONSIZE_POS(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return (SFR_DATA)0;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_SOURCEPOINTER_POS(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return (SFR_DATA)0;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_DESTINATIONPOINTER_POS(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return (SFR_DATA)0;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_CELLSIZE_POS(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return (SFR_DATA)0;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_CELLPROGRESSPOINTER_POS(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return (SFR_DATA)0;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_PATTERNDATA_POS(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return (SFR_DATA)0;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

