MicrochipTech/wcm-aws-iot-sdk/microchip/harmony/v1_06/framework/peripheral/dma/processor/dma_p32mx695f512h.h
PLIB_INLINE SFR_DATA _DMA_BUSY_LEN(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DMACON_DMABUSY_LENGTH;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_SUSPEND_LEN(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DMACON_SUSPEND_LENGTH;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_ENABLE_CONTROL_LEN(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DMACON_ON_LENGTH;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNELBITS_LEN(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DMASTAT_DMACH_LENGTH;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_LASTBUSACCESS_LEN(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DMASTAT_RDWR_LENGTH;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_RECENTADDRESS_LEN(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CRC_CHANNEL_LEN(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCRCCON_CRCCH_LENGTH;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CRC_TYPE_LEN(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCRCCON_CRCTYP_LENGTH;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CRC_APPEND_MODE_LEN(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCRCCON_CRCAPP_LENGTH;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CRC_ENABLE_LEN(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCRCCON_CRCEN_LENGTH;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CRC_POLYNOMIAL_LENGTH_LEN(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCRCCON_PLEN_LENGTH;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CRC_BIT_ORDER_LEN(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCRCCON_BITO_LENGTH;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CRC_WRITE_BYTE_ORDER_LEN(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCRCCON_WBO_LENGTH;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CRC_BYTE_ORDER_LEN(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCRCCON_BYTO_LENGTH;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CRC_DATA_LEN(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CRC_XOR_ENABLE_LEN(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_PRIORITY_LEN(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCH0CON_CHPRI_LENGTH;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_EVENT_LEN(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCH0CON_CHEDET_LENGTH;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_AUTO_LEN(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCH0CON_CHAEN_LENGTH;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_CHAIN_ENABLE_LEN(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCH0CON_CHCHN_LENGTH;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_DISABLED_LEN(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCH0CON_CHAED_LENGTH;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_LEN(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCH0CON_CHEN_LENGTH;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_CHAIN_LEN(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCH0CON_CHCHNS_LENGTH;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_BUSY_LEN(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCH0CON_CHBUSY_LENGTH;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_TRIGGER_AIRQEN_LEN(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCH0ECON_AIRQEN_LENGTH;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _DMA_CHANNEL_X_TRIGGER_SIRQEN_LEN(DMA_MODULE_ID i)
{
    switch (i) {
        case DMA_ID_0 :
            return _DCH0ECON_SIRQEN_LENGTH;
        case DMA_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

