MicrochipTech/wcm-aws-iot-sdk/microchip/harmony/v1_06/framework/peripheral/dma/processor/dma_p32mx695f512h.h
PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_DMA_StopInIdleEnable(DMA_MODULE_ID index)
{
    switch (index) {
        case DMA_ID_0 :
            DMA_StopInIdleEnable_Unsupported(index);
            break;
        case DMA_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_DMA_StopInIdleDisable(DMA_MODULE_ID index)
{
    switch (index) {
        case DMA_ID_0 :
            DMA_StopInIdleDisable_Unsupported(index);
            break;
        case DMA_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_DMA_ExistsEnableControl(DMA_MODULE_ID index)
{
    switch (index) {
        case DMA_ID_0 :
            return DMA_ExistsEnableControl_Default(index);
        case DMA_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_DMA_Enable(DMA_MODULE_ID index)
{
    switch (index) {
        case DMA_ID_0 :
            DMA_Enable_Default(index);
            break;
        case DMA_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_DMA_Disable(DMA_MODULE_ID index)
{
    switch (index) {
        case DMA_ID_0 :
            DMA_Disable_Default(index);
            break;
        case DMA_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_DMA_IsEnabled(DMA_MODULE_ID index)
{
    switch (index) {
        case DMA_ID_0 :
            return DMA_IsEnabled_Default(index);
        case DMA_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_DMA_ExistsChannelBits(DMA_MODULE_ID index)
{
    switch (index) {
        case DMA_ID_0 :
            return DMA_ExistsChannelBits_Default(index);
        case DMA_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API uint8_t PLIB_DMA_ChannelBitsGet(DMA_MODULE_ID index)
{
    switch (index) {
        case DMA_ID_0 :
            return DMA_ChannelBitsGet_Default(index);
        case DMA_NUMBER_OF_MODULES :
        default :
            return (uint8_t)0;
    }
}

PLIB_INLINE_API bool PLIB_DMA_ExistsLastBusAccess(DMA_MODULE_ID index)
{
    switch (index) {
        case DMA_ID_0 :
            return DMA_ExistsLastBusAccess_Default(index);
        case DMA_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_DMA_LastBusAccessIsRead(DMA_MODULE_ID index)
{
    switch (index) {
        case DMA_ID_0 :
            return DMA_LastBusAccessIsRead_Default(index);
        case DMA_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_DMA_LastBusAccessIsWrite(DMA_MODULE_ID index)
{
    switch (index) {
        case DMA_ID_0 :
            return DMA_LastBusAccessIsWrite_Default(index);
        case DMA_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_DMA_ExistsRecentAddress(DMA_MODULE_ID index)
{
    switch (index) {
        case DMA_ID_0 :
            return DMA_ExistsRecentAddress_Default(index);
        case DMA_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API uint32_t PLIB_DMA_RecentAddressAccessed(DMA_MODULE_ID index)
{
    switch (index) {
        case DMA_ID_0 :
            return DMA_RecentAddressAccessed_Default(index);
        case DMA_NUMBER_OF_MODULES :
        default :
            return (uint32_t)0;
    }
}

PLIB_INLINE_API bool PLIB_DMA_ExistsCRCChannel(DMA_MODULE_ID index)
{
    switch (index) {
        case DMA_ID_0 :
            return DMA_ExistsCRCChannel_Default(index);
        case DMA_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_DMA_CRCChannelSelect(DMA_MODULE_ID index, DMA_CHANNEL channel)
{
    switch (index) {
        case DMA_ID_0 :
            DMA_CRCChannelSelect_Default(index, channel);
            break;
        case DMA_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API DMA_CHANNEL PLIB_DMA_CRCChannelGet(DMA_MODULE_ID index)
{
    switch (index) {
        case DMA_ID_0 :
            return DMA_CRCChannelGet_Default(index);
        case DMA_NUMBER_OF_MODULES :
        default :
            return (DMA_CHANNEL)0;
    }
}

PLIB_INLINE_API bool PLIB_DMA_ExistsCRCType(DMA_MODULE_ID index)
{
    switch (index) {
        case DMA_ID_0 :
            return DMA_ExistsCRCType_Default(index);
        case DMA_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API DMA_CRC_TYPE PLIB_DMA_CRCTypeGet(DMA_MODULE_ID index)
{
    switch (index) {
        case DMA_ID_0 :
            return DMA_CRCTypeGet_Default(index);
        case DMA_NUMBER_OF_MODULES :
        default :
            return (DMA_CRC_TYPE)0;
    }
}

PLIB_INLINE_API void PLIB_DMA_CRCTypeSet(DMA_MODULE_ID index, DMA_CRC_TYPE CRCType)
{
    switch (index) {
        case DMA_ID_0 :
            DMA_CRCTypeSet_Default(index, CRCType);
            break;
        case DMA_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_DMA_ExistsCRCAppendMode(DMA_MODULE_ID index)
{
    switch (index) {
        case DMA_ID_0 :
            return DMA_ExistsCRCAppendMode_Default(index);
        case DMA_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_DMA_CRCAppendModeEnable(DMA_MODULE_ID index)
{
    switch (index) {
        case DMA_ID_0 :
            DMA_CRCAppendModeEnable_Default(index);
            break;
        case DMA_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_DMA_CRCAppendModeDisable(DMA_MODULE_ID index)
{
    switch (index) {
        case DMA_ID_0 :
            DMA_CRCAppendModeDisable_Default(index);
            break;
        case DMA_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_DMA_CRCAppendModeIsEnabled(DMA_MODULE_ID index)
{
    switch (index) {
        case DMA_ID_0 :
            return DMA_CRCAppendModeIsEnabled_Default(index);
        case DMA_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_DMA_ExistsCRC(DMA_MODULE_ID index)
{
    switch (index) {
        case DMA_ID_0 :
            return DMA_ExistsCRC_Default(index);
        case DMA_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_DMA_CRCEnable(DMA_MODULE_ID index)
{
    switch (index) {
        case DMA_ID_0 :
            DMA_CRCEnable_Default(index);
            break;
        case DMA_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_DMA_CRCDisable(DMA_MODULE_ID index)
{
    switch (index) {
        case DMA_ID_0 :
            DMA_CRCDisable_Default(index);
            break;
        case DMA_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_DMA_CRCIsEnabled(DMA_MODULE_ID index)
{
    switch (index) {
        case DMA_ID_0 :
            return DMA_CRCIsEnabled_Default(index);
        case DMA_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

