MicrochipTech/wcm-aws-iot-sdk/microchip/harmony/v1_06/framework/peripheral/dma/processor/dma_p32mx695f512h.h
PLIB_INLINE_API bool PLIB_DMA_ExistsCRCPolynomialLength(DMA_MODULE_ID index)
{
    switch (index) {
        case DMA_ID_0 :
            return DMA_ExistsCRCPolynomialLength_Default(index);
        case DMA_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_DMA_CRCPolynomialLengthSet(DMA_MODULE_ID index, uint8_t polyLength)
{
    switch (index) {
        case DMA_ID_0 :
            DMA_CRCPolynomialLengthSet_Default(index, polyLength);
            break;
        case DMA_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API uint8_t PLIB_DMA_CRCPolynomialLengthGet(DMA_MODULE_ID index)
{
    switch (index) {
        case DMA_ID_0 :
            return DMA_CRCPolynomialLengthGet_Default(index);
        case DMA_NUMBER_OF_MODULES :
        default :
            return (uint8_t)0;
    }
}

PLIB_INLINE_API bool PLIB_DMA_ExistsCRCBitOrder(DMA_MODULE_ID index)
{
    switch (index) {
        case DMA_ID_0 :
            return DMA_ExistsCRCBitOrder_Default(index);
        case DMA_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_DMA_CRCBitOrderSelect(DMA_MODULE_ID index, DMA_CRC_BIT_ORDER bitOrder)
{
    switch (index) {
        case DMA_ID_0 :
            DMA_CRCBitOrderSelect_Default(index, bitOrder);
            break;
        case DMA_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_DMA_ExistsCRCWriteByteOrder(DMA_MODULE_ID index)
{
    switch (index) {
        case DMA_ID_0 :
            return DMA_ExistsCRCWriteByteOrder_Default(index);
        case DMA_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_DMA_CRCWriteByteOrderAlter(DMA_MODULE_ID index)
{
    switch (index) {
        case DMA_ID_0 :
            DMA_CRCWriteByteOrderAlter_Default(index);
            break;
        case DMA_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_DMA_CRCWriteByteOrderMaintain(DMA_MODULE_ID index)
{
    switch (index) {
        case DMA_ID_0 :
            DMA_CRCWriteByteOrderMaintain_Default(index);
            break;
        case DMA_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_DMA_ExistsCRCByteOrder(DMA_MODULE_ID index)
{
    switch (index) {
        case DMA_ID_0 :
            return DMA_ExistsCRCByteOrder_Default(index);
        case DMA_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_DMA_CRCByteOrderSelect(DMA_MODULE_ID index, DMA_CRC_BYTE_ORDER byteOrder)
{
    switch (index) {
        case DMA_ID_0 :
            DMA_CRCByteOrderSelect_Default(index, byteOrder);
            break;
        case DMA_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API DMA_CRC_BYTE_ORDER PLIB_DMA_CRCByteOrderGet(DMA_MODULE_ID index)
{
    switch (index) {
        case DMA_ID_0 :
            return DMA_CRCByteOrderGet_Default(index);
        case DMA_NUMBER_OF_MODULES :
        default :
            return (DMA_CRC_BYTE_ORDER)0;
    }
}

PLIB_INLINE_API bool PLIB_DMA_ExistsCRCData(DMA_MODULE_ID index)
{
    switch (index) {
        case DMA_ID_0 :
            return DMA_ExistsCRCData_Default(index);
        case DMA_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API uint32_t PLIB_DMA_CRCDataRead(DMA_MODULE_ID index)
{
    switch (index) {
        case DMA_ID_0 :
            return DMA_CRCDataRead_Default(index);
        case DMA_NUMBER_OF_MODULES :
        default :
            return (uint32_t)0;
    }
}

PLIB_INLINE_API void PLIB_DMA_CRCDataWrite(DMA_MODULE_ID index, uint32_t DMACRCdata)
{
    switch (index) {
        case DMA_ID_0 :
            DMA_CRCDataWrite_Default(index, DMACRCdata);
            break;
        case DMA_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_DMA_ExistsCRCXOREnable(DMA_MODULE_ID index)
{
    switch (index) {
        case DMA_ID_0 :
            return DMA_ExistsCRCXOREnable_Default(index);
        case DMA_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_DMA_CRCXOREnableSet(DMA_MODULE_ID index, uint32_t DMACRCXOREnableMask)
{
    switch (index) {
        case DMA_ID_0 :
            DMA_CRCXOREnableSet_Default(index, DMACRCXOREnableMask);
            break;
        case DMA_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API uint32_t PLIB_DMA_CRCXOREnableGet(DMA_MODULE_ID index)
{
    switch (index) {
        case DMA_ID_0 :
            return DMA_CRCXOREnableGet_Default(index);
        case DMA_NUMBER_OF_MODULES :
        default :
            return (uint32_t)0;
    }
}

PLIB_INLINE_API bool PLIB_DMA_ExistsChannelXPriority(DMA_MODULE_ID index)
{
    switch (index) {
        case DMA_ID_0 :
            return DMA_ExistsChannelXPriority_Default(index);
        case DMA_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_DMA_ChannelXPrioritySelect(DMA_MODULE_ID index, DMA_CHANNEL channel, DMA_CHANNEL_PRIORITY channelPriority)
{
    switch (index) {
        case DMA_ID_0 :
            DMA_ChannelXPrioritySelect_Default(index, channel, channelPriority);
            break;
        case DMA_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API DMA_CHANNEL_PRIORITY PLIB_DMA_ChannelXPriorityGet(DMA_MODULE_ID index, DMA_CHANNEL channel)
{
    switch (index) {
        case DMA_ID_0 :
            return DMA_ChannelXPriorityGet_Default(index, channel);
        case DMA_NUMBER_OF_MODULES :
        default :
            return (DMA_CHANNEL_PRIORITY)0;
    }
}

PLIB_INLINE_API bool PLIB_DMA_ExistsChannelXEvent(DMA_MODULE_ID index)
{
    switch (index) {
        case DMA_ID_0 :
            return DMA_ExistsChannelXEvent_Default(index);
        case DMA_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_DMA_ChannelXEventIsDetected(DMA_MODULE_ID index, DMA_CHANNEL channel)
{
    switch (index) {
        case DMA_ID_0 :
            return DMA_ChannelXEventIsDetected_Default(index, channel);
        case DMA_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

