MicrochipTech/wcm-aws-iot-sdk/microchip/harmony/v1_06/framework/peripheral/dma/processor/dma_p32mx695f512h.h
PLIB_INLINE_API void PLIB_DMA_ChannelXAbortIRQSet(DMA_MODULE_ID index, DMA_CHANNEL channel, DMA_TRIGGER_SOURCE IRQ)
{
    switch (index) {
        case DMA_ID_0 :
            DMA_ChannelXAbortIRQSet_Default(index, channel, IRQ);
            break;
        case DMA_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_DMA_ExistsChannelXINTSourceFlag(DMA_MODULE_ID index)
{
    switch (index) {
        case DMA_ID_0 :
            return DMA_ExistsChannelXINTSourceFlag_Default(index);
        case DMA_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_DMA_ChannelXINTSourceFlagGet(DMA_MODULE_ID index, DMA_CHANNEL dmaChannel, DMA_INT_TYPE dmaINTSource)
{
    switch (index) {
        case DMA_ID_0 :
            return DMA_ChannelXINTSourceFlagGet_Default(index, dmaChannel, dmaINTSource);
        case DMA_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_DMA_ChannelXINTSourceFlagSet(DMA_MODULE_ID index, DMA_CHANNEL dmaChannel, DMA_INT_TYPE dmaINTSource)
{
    switch (index) {
        case DMA_ID_0 :
            DMA_ChannelXINTSourceFlagSet_Default(index, dmaChannel, dmaINTSource);
            break;
        case DMA_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_DMA_ChannelXINTSourceFlagClear(DMA_MODULE_ID index, DMA_CHANNEL dmaChannel, DMA_INT_TYPE dmaINTSource)
{
    switch (index) {
        case DMA_ID_0 :
            DMA_ChannelXINTSourceFlagClear_Default(index, dmaChannel, dmaINTSource);
            break;
        case DMA_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_DMA_ExistsChannelXINTSource(DMA_MODULE_ID index)
{
    switch (index) {
        case DMA_ID_0 :
            return DMA_ExistsChannelXINTSource_Default(index);
        case DMA_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_DMA_ChannelXINTSourceEnable(DMA_MODULE_ID index, DMA_CHANNEL dmaChannel, DMA_INT_TYPE dmaINTSource)
{
    switch (index) {
        case DMA_ID_0 :
            DMA_ChannelXINTSourceEnable_Default(index, dmaChannel, dmaINTSource);
            break;
        case DMA_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_DMA_ChannelXINTSourceDisable(DMA_MODULE_ID index, DMA_CHANNEL dmaChannel, DMA_INT_TYPE dmaINTSource)
{
    switch (index) {
        case DMA_ID_0 :
            DMA_ChannelXINTSourceDisable_Default(index, dmaChannel, dmaINTSource);
            break;
        case DMA_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_DMA_ChannelXINTSourceIsEnabled(DMA_MODULE_ID index, DMA_CHANNEL dmaChannel, DMA_INT_TYPE dmaINTSource)
{
    switch (index) {
        case DMA_ID_0 :
            return DMA_ChannelXINTSourceIsEnabled_Default(index, dmaChannel, dmaINTSource);
        case DMA_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_DMA_ExistsChannelXSourceStartAddress(DMA_MODULE_ID index)
{
    switch (index) {
        case DMA_ID_0 :
            return DMA_ExistsChannelXSourceStartAddress_Default(index);
        case DMA_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API uint32_t PLIB_DMA_ChannelXSourceStartAddressGet(DMA_MODULE_ID index, DMA_CHANNEL dmaChannel)
{
    switch (index) {
        case DMA_ID_0 :
            return DMA_ChannelXSourceStartAddressGet_Default(index, dmaChannel);
        case DMA_NUMBER_OF_MODULES :
        default :
            return (uint32_t)0;
    }
}

PLIB_INLINE_API void PLIB_DMA_ChannelXSourceStartAddressSet(DMA_MODULE_ID index, DMA_CHANNEL dmaChannel, uint32_t sourceStartAddress)
{
    switch (index) {
        case DMA_ID_0 :
            DMA_ChannelXSourceStartAddressSet_Default(index, dmaChannel, sourceStartAddress);
            break;
        case DMA_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_DMA_ExistsChannelXDestinationStartAddress(DMA_MODULE_ID index)
{
    switch (index) {
        case DMA_ID_0 :
            return DMA_ExistsChannelXDestinationStartAddress_Default(index);
        case DMA_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API uint32_t PLIB_DMA_ChannelXDestinationStartAddressGet(DMA_MODULE_ID index, DMA_CHANNEL dmaChannel)
{
    switch (index) {
        case DMA_ID_0 :
            return DMA_ChannelXDestinationStartAddressGet_Default(index, dmaChannel);
        case DMA_NUMBER_OF_MODULES :
        default :
            return (uint32_t)0;
    }
}

PLIB_INLINE_API void PLIB_DMA_ChannelXDestinationStartAddressSet(DMA_MODULE_ID index, DMA_CHANNEL dmaChannel, uint32_t destinationStartAddress)
{
    switch (index) {
        case DMA_ID_0 :
            DMA_ChannelXDestinationStartAddressSet_Default(index, dmaChannel, destinationStartAddress);
            break;
        case DMA_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_DMA_ExistsChannelXSourceSize(DMA_MODULE_ID index)
{
    switch (index) {
        case DMA_ID_0 :
            return DMA_ExistsChannelXSourceSize_Default(index);
        case DMA_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API uint16_t PLIB_DMA_ChannelXSourceSizeGet(DMA_MODULE_ID index, DMA_CHANNEL dmaChannel)
{
    switch (index) {
        case DMA_ID_0 :
            return DMA_ChannelXSourceSizeGet_Default(index, dmaChannel);
        case DMA_NUMBER_OF_MODULES :
        default :
            return (uint16_t)0;
    }
}

PLIB_INLINE_API void PLIB_DMA_ChannelXSourceSizeSet(DMA_MODULE_ID index, DMA_CHANNEL dmaChannel, uint16_t sourceSize)
{
    switch (index) {
        case DMA_ID_0 :
            DMA_ChannelXSourceSizeSet_Default(index, dmaChannel, sourceSize);
            break;
        case DMA_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_DMA_ExistsChannelXDestinationSize(DMA_MODULE_ID index)
{
    switch (index) {
        case DMA_ID_0 :
            return DMA_ExistsChannelXDestinationSize_Default(index);
        case DMA_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API uint16_t PLIB_DMA_ChannelXDestinationSizeGet(DMA_MODULE_ID index, DMA_CHANNEL dmaChannel)
{
    switch (index) {
        case DMA_ID_0 :
            return DMA_ChannelXDestinationSizeGet_Default(index, dmaChannel);
        case DMA_NUMBER_OF_MODULES :
        default :
            return (uint16_t)0;
    }
}

